{"K1":{
  "type": 1,
  "content":"Giới từ"
},
"K2":{
  "type": 2,
  "content": "   1.Giới Từ là gì?"
  },
  "k3":{
  "type": 3,
  "content": "Trong ngữ pháp tiếng Anh, giới từ (preposition) chính là từ hoặc nhóm từ thường được sử dụng trước danh từ hoặc đại từ để chỉ mối liên hệ giữa danh từ hoặc đại từ này với các thành phần khác trong câu. Những từ thường đi sau giới từ là tân ngữ (Object), Verb + ing, Cụm danh từ …"
  },
  "k4":{
  "type": 4,
  "content": "    Ví dụ:"
  },
  "k5":{
    "type": 5,
    "content":"         I go to the cinema on Monday."
  },
  "k6":{
    "type": 6,
    "content":"  “Monday” là tân ngữ của giới từ “on”"
  },
  "k7":{
    "type": 7,
    "content":"   2.Cụm Giới Từ là gì?"
  },
  "k8":{
    "type": 8,
    "content":"Cụm giới từ (Prepositional phrase) chính là 1 nhóm từ bắt đầu bằng một giới từ. Theo sau giới từ thường là một cụm danh từ, đại từ, trạng từ, một cụm trạng từ (địa điểm hoặc thời gian), hoặc một danh động từ; ít phổ biến hơn là một cụm giới từ, câu bắt đầu bằng V-ing hoặc mệnh đề bắt đầu bằng câu hỏi wh."
  },
  "k9":{
    "type": 9,
    "content":"Ví dụ: at a party…,with me…,From there…"
  },
  "k10":{
    "type": 10,
    "content":"   3.Cách Sử Dụng Giới Từ "
  },
  "k11":{
    "type": 11,
    "content":"Cách sử dụng các giới từ trong tiếng Anh không hề đơn giản. Thực tế, không có quy luật cố định về cách sử dụng giới từ, cùng một giới từ nhưng khi kết hợp với các từ loại khác nhau sẽ tạo ra nghĩa khác biệt. Cách duy nhất là bạn nên chú ý học thuộc việc sử dụng giới từ ngay từ đầu.Ghi nhớ 47 cách sử dụng giới từ trong tiếng Anh sẽ giúp bạn biết cách dùng giới từ trong câu chính xác nhất. Giới từ có thể đứng ở các vị trí sau:"
  },
  "k12":{
    "type": 12,
    "content":"Đứng sau động từ “to be”, trước danh từ: "
  },
  "k13":{
    "type": 13,
    "content":"   Ví dụ: The pencil is on the table" 
  },
  "k14":{
    "type": 14,
    "content":"Có thể liền sau động từ hoặc bị 1 từ khác chen giữa động từ và giới từ.        "
  },
  "k15":{
    "type": 15,
    "content":"Ví dụ: I live in Ho Chi Minh City" 
  },
}
